In [10]:
import numpy as np
import pandas as pd

In [16]:
d = {'A': [1,np.nan,3], 'B':[2, np.nan, np.nan], 'C': [3,4,5]}

In [18]:
df = pd.DataFrame(d)

In [20]:
df

     A    B  C
0  1.0  2.0  3
1  NaN  NaN  4
2  3.0  NaN  5

In [ ]:
#a dictionary can create a data frame, with the keys as columns, and the list as the values

In [22]:
df.dropna() #drops all rows that have nan in it

     A    B  C
0  1.0  2.0  3

In [24]:
df.dropna(axis = 1) #drops all the columns that have null values

   C
0  3
1  4
2  5

In [30]:
df.dropna(thresh = 1)

     A    B  C
0  1.0  2.0  3
1  NaN  NaN  4
2  3.0  NaN  5

In [ ]:
#thresh means that if the row has at least one non-null value

In [41]:
df.dropna(axis = 1, thresh = 1)

     A    B  C
0  1.0  2.0  3
1  NaN  NaN  4
2  3.0  NaN  5

In [43]:
df.dropna(axis = 1, thresh = 2) #you can employ the same method with the columns

     A  C
0  1.0  3
1  NaN  4
2  3.0  5

In [39]:
df

     A    B  C
0  1.0  2.0  3
1  NaN  NaN  4
2  3.0  NaN  5

In [45]:
df.fillna('Fill')

      A     B  C
0   1.0   2.0  3
1  Fill  Fill  4
2   3.0  Fill  5

In [47]:
df.fillna(value = 'fill')

      A     B  C
0   1.0   2.0  3
1  fill  fill  4
2   3.0  fill  5

In [49]:
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    3.0
Name: A, dtype: float64

In [51]:
df.fillna(df.mean()) #fills with the mean of each column

     A    B  C
0  1.0  2.0  3
1  2.0  2.0  4
2  3.0  2.0  5

In [62]:
df.std()

A    1.414214
B         NaN
C    1.000000
dtype: float64